<?php

return [
    // 状态码
    'status' => [
        "success" => 1, // 成功
        "error" => 0, // 错误
        "not_login" => -1, // 未登录
        "user_is_register" => -2, // 用户已注册
        "action_not_found" => -3, // 方法未找到
        "validate_error" => -4, // 参数错误
    ],
    // http状态码
    "http_status" => [
        "not_found" => 404,
        "validate_error" => 422,
        "internal_error" => 500
    ],
    // 错误信息
    'code_msg' => [
        1001 => '数据库数据不存在',
        1002 => '未发送必填数据',
        1003 => '数据格式不符合要求',
        1004 => '超出范围',
        2001 => '用户未登录',
        2002 => '用户不存在',
        2003 => '密码错误',
        2004 => '权限不足',
        2005 => '验证码错误',
        2006 => '绑定失败',
        4001 => '查询数据失败',
        4002 => '新增数据失败',
        4003 => '删除数据失败',
        4004 => '修改数据失败',
        4005 => '数据获取失败',
        5001 => '文件上传失败'
    ],
    // 默认删除标志
    'delete_flag' => 1,
];